Revit 2024 API
Element.CanDeleteSubelement Method
 Checks if given subelement can be removed from the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool CanDeleteSubelement(
	Subelement subelem
)
Visual Basic
Public Function CanDeleteSubelement ( _
	subelem As Subelement _
) As Boolean
Visual C++
public:
bool CanDeleteSubelement(
	Subelement^ subelem
)
Parameters
subelem
Type: Autodesk.Revit.DB.Subelement
 Subelement to check.
Return Value
 True if subelement can be removed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace